Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེའི་འོག་ཏུ་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ལ་སྤྱོད་པ་མེད་པར་བརྗོད་པས། བཤད་པ་འདི་ལ་སྤྱད་པ་དོན་མེད་དོ་སྙམ་དུ་སེམས་པ་རྣམས་ཀྱི་དོགས་པ་དེ་བསྩལ་བའི་ཕྱིར་འོག་ནས་བསོད་ནམས་མང་བ་དང་།
en: Then to eliminate the doubts of those who think that because it has said they “do not practice” in all dharmas, “in form” and so on, therefore nothing of benefit comes from the practice explained here, it then says there is a lot of merit and explains its cause.

source: དེའི་རྒྱུ་གསུངས་ཏེ། བསོད་ནམས་མང་དུ་འཕེལ་བ་དེ་དང་། དེའི་རྒྱུ་ཡང་ནོར་བུ་རིན་པོ་ཆེའི་དཔེས་གཞུང་ཉིད་ལས་རིག་པར་བྱའོ། །བཅོམ་ལྡན་འདས་གང་ཡིད་ལ་བགྱི་བ་ཐམས་ཅད་རང་བཞིན་དང་བྲལ་བ་སྟེ། ཡིད་ལ་བགྱི་བ་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན་ཞེས་བྱ་བ་འདིས་འདི་སྐད་ཞུས་ཏེ།
en: You can understand the great increase in merit, and the cause for that as well, from the illustration of “a precious jewel” in the text itself. “

source: གལ་ཏེ་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་ཞིང་བྲལ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་རིག་པར་འགྱུར། ངོ་བོ་ཉིད་ཀྱིས་དབེན་ཞིང་སྟོང་པ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམ། ཡིད་ལ་བྱེད་པའམ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་མི་དམིགས་སོ་ཞེས་ཞུས་པའོ།
en: Lord, given that all attention is separated from an intrinsic nature, that all attention is empty of an intrinsic nature” is asking: if all attentions are isolated and separated from an intrinsic nature, how can they know they are “never separated from attention to the knowledge of all aspects,” because when they are separated from and empty of an intrinsic nature, you cannot apprehend any “knowledge of all aspects, or attention, or bodhisattva.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཡིད་ལ་བྱེད་པ་རྣམས་ཆོས་གཞན་ཞིག་ཏུ་ཡོངས་སུ་བརྟགས་ནས་དེ་སྐད་གསུངས་པ་ནི་མ་ཡིན་གྱི། བྱང་ཆུབ་སེམས་དཔའ་གང་། ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པར་ཤེས་པ་དེ་ཙམ་གྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བའོ་ཞེས་བརྟགས་པ་ཙམ་དུ་ཟད་ཀྱི། དོན་དམ་པར་ནི་དེ་དག་ལ་ཐ་དད་པ་མེད་པར། རབ་འབྱོར་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཤེས་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་སྟོན་ཏོ།
en: Then, with “Subhūti, if bodhisattva great beings know this,” and so on, the Lord, not speaking while having falsely imagined a knowledge of all aspects, a bodhisattva, and attention as some other phenomena, without there being any ultimate difference between them, still simply designates bodhisattvas as “not separated from attention connected to the knowledge of all aspects,” just on account of their knowing all phenomena are isolated from an intrinsic nature. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ་ཞེས་བྱ་བ་ནི་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ། དྲི་མ་མེད་པའི་ཤེས་རབ་ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་པ། ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་པའོ།
en: The perfection of wisdom is empty of an intrinsic nature”— naturally pure and stainless wisdom is isolated from all dharmas, is empty of all dharmas. “

source: །དེ་ལ་འཕེལ་བ་མེད་དོ།
en: It has no increase and it has no decline.”

source: །ཡོངས་སུ་འགྲིབ་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་རབ་ཏུ་ཞུགས་པའི་དབང་གིས་གློ་བུར་དུ་འཕེལ་བ་ཡང་མེད།
en: This means there is neither increase, plucked out of thin air, on account of striving, nor is there decline on account of not striving. “

source: མ་ཞུགས་པའི་དབང་གིས་འགྲིབ་པ་ཡང་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་བཞིན་གྱིས་དབེན་ཞིང་། རང་བཞིན་གྱིས་སྟོང་པ་ལགས་ན་ཞེས་ཞུས་པ་གཉིས་པ་ནི།
en: Lord, given that the perfection of wisdom is separated from an intrinsic nature and empty of an intrinsic nature” is the second question.

source: གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའི་ངོ་བོ་ཉིད་ཡིན་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་ཞིང་སྟོང་པས་ཇི་ལྟར་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱེད་ཅེས་ཞུས་པའོ།
en: It is asking how, if the perfection of wisdom is separated from an intrinsic nature, will an isolated, empty perfection of wisdom bring about full awakening to perfect, complete awakening.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་ཀྱི་སྐུའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་དབེན་པ་ཉིད་དང་། སྟོང་པ་ཉིད་ཡིན་ཏེ།
en: Then the Lord explains that bodhisattvas are the intrinsic nature of the dharma body so they are a separated state, an empty state.

source: དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དབང་གིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་ཞེས་བྱ་བ་དེ་ལྟ་བུ་མེད་དེ། ཆོས་ཀྱི་སྐུའི་བྱང་ཆུབ་སེམས་དཔའ་ནི།
en: Furthermore, he is teaching that it is not as if dharma body bodhisattvas fully awaken to perfect, complete awakening on account of the power of the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ནས་འཕེལ་བར་འགྱུར་བ་ཡང་མེད་ལ། དེ་ལ་མ་བརྟེན་ན་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་ཡང་མེད་དེ། གནས་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་རོ་ཞེས་སྟོན་ཏོ།
en: They do not become more of what they are thanks to the perfection of wisdom, and they do not become less when they do not rely on the perfection of wisdom either, because they are marked by staying as what they are.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གཅིག་ཀྱང་མ་ཡིན། གཉིས་ཀྱང་མ་ཡིན་ནོ་ཞེས་བྱ་བས་སྟོན་ཏེ།
en: He says, “Subhūti, the perfection of wisdom is not one and it is not two either.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་དེ་དག་ནི་གཅིག་སྟེ། གཉིས་སུ་བྱར་མེད་ཅིང་གྲངས་ཀྱི་བྱེ་བྲག་གིས་ཐ་དད་པ་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: He means “the knowledge of all aspects,” “bodhisattva,” “perfection of wisdom,” and “suchness” are not one, they cannot be divided, and they are not different in terms of a particular enumeration.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོང་པ་ཉིད་དང་། གསོག་ཉིད་དང་། གསོབ་དང་། ཡ་མ་བརླ་ཉིད་དང་། སྙིང་པོ་མ་མཆིས་པ་ཉིད་གང་ལགས་པ་དེ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུ་བ་གསུམ་པ་འདི་སྐད་ཞུས་ཏེ། ཅི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོང་པ་ཉིད།
en: The third question is, “Lord, is it the emptiness of the perfection of wisdom, its state of ringing hollow, being in vain, being a fraud, and being pointless, that practices the perfection of wisdom?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། ཅི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་འབའ་ཞིག་སྤྱོད་དམ། འོན་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དམ། འོན་ཏེ་སྟོང་པ་ཉིད་སྤྱོད་དམ། འོན་ཏེ་སྟོང་པ་ཉིད་ལས་གཞན་པ་ཞིག་སྤྱོད་དམ་ཞེས་བྱ་བ་རྣམ་པར་རྟོག་པ་ལྔ་དང་།
en: He is asking about five possibilities: “Is it the emptiness of the perfection of wisdom” that practices the perfection of wisdom; or does something other than the perfection of wisdom practice; or does the perfection of wisdom practice; or does emptiness practice; or does something other than emptiness practice?

source: དེ་བཞིན་དུ་ཅི་གཟུགས་ལ་སོགས་པ་སྤྱོད་དམ། འོན་ཏེ་ཅི་གཟུགས་ལ་སོགས་པའི་སྟོང་པ་ཉིད་སྤྱོད་དམ་ཞེས་བྱ་བ་རྣམ་པར་རྟོག་པ་གཉིས་ཏེ།
en: And, similarly, about two other possibilities: is it form and so on that practices or is it the emptiness of form and so on that practices?

source: དེ་ལྟར་རྣམ་པར་རྟོག་པ་བདུན་ཉེ་བར་བཟུང་ནས་ཞུས་པ་དང་།
en: He has asked based on seven possibilities like that.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པར་རྟོག་པ་དེ་དག་ཉིད་དངོས་པོ་མེད་པས་སྤྱོད་པ་གང་ཡིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཇི་ལྟར་སྤྱོད་པ་དེ་དག་མི་དམིགས་པ་དང་། དེ་ནས་ཡང་མི་སྣང་བ་དག་མི་དམིགས་པ་དང་། སྐྱེ་བ་དང་འགག་པ་དག་མི་དམིགས་པ་ཉེ་བར་བཟུང་ནས།
en: Then, because those same possibilities are in fact impossible, the Lord does not apprehend the practice, the perfection of wisdom, or a way of practicing; and then does not apprehended even nonappearances; and does not apprehend “production or stopping” either.

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པར་ལུང་བསྟན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་བསྟན་ཏོ།
en: Taking that as his point of departure, the Lord gives an explanation of those bodhisattva great beings endowed with the forbearance for the nonproduction of dharmas who have been prophesied. “

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས། ཆོས་ཐམས་ཅད་སྐྱེ་བའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་རམ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་སྐྱེ་བའི་ཕྱིར་རོ།
en: Lord, is the bodhisattvas’ unsurpassed, perfect, complete awakening prophesied because there will be a production of all the dharmas?” Is it on account of the production of all the buddhadharmas?

source: །ཆོས་ཐམས་ཅད་མི་སྐྱེ་བའི་སླད་དུ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་སམ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཀྱང་རུང་སྟེ་ཐམས་ཅད་མི་སྐྱེ་བའི་ཕྱིར་རོ།
en: Is it because of “the nonproduction of all the dharmas?” Is it on account of the nonproduction of any of the dharmas—form and so on—or the defilement dharmas? “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་བའི་ཆོས་དེ་ལྟ་བུ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ་ཞེས་བྱ་བ་ནི་ལུང་བསྟན་པར་བྱ་བ་དང་།
en: What do you think, Subhūti, do you see that dharma, the dharma of which unsurpassed, perfect, complete awakening is being prophesied?”

source: མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱེད་པ་དངོས་པོ་མེད་པས་འདི་དང་། འདི་ལྟ་བུའི་དོན་དུ་ལུང་བསྟན་པར་འགྱུར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: means something being prophesied and something causing full awakening are nonexistent things, so there is no such thing as a prophesy of this or that type of state.

source: །དེ་ལྟར་ཟབ་ཅིང་ཟབ་པའི་གནས་དག་བསྟན་པས། བཅོམ་ལྡན་འདས་འདི་ནི་ཟབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསོལ་ཏོ།
en: On account of such explanations of the deep places, it says “Lord, this perfection of wisdom is deep,” and so on.

source: །དེ་ནས་ཡང་བསོད་ནམས་མང་པོ་བསྟན་པ་ཡང་། དད་པ་རབ་ཏུ་སྐྱེད་པའི་ཕྱིར་རོ། །རབ་ཏུ་བསྔགས་པའི་ཚིག་ཐམས་ཅད་དང་། ཕན་ཡོན་བསྟན་པ་དང་། བརྒྱ་བྱིན་དང་། ཀུན་དགའ་བོའི་ཚིག་དང་། བདུད་ཀྱི་གཏམ་དང་། བདུད་ཀྱི་ལས་དང་། དེ་ལས་བྱུང་བའི་གཏམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་རྣམས་ཀྱི་དྲུང་དུ་ཇི་ལྟར་གནས་པར་བྱ་བ་དང་།
en: Explanation of Chapters 56 to 63 Then it goes on to give an explanation of great merit again in order to generate faith.

source: མཉམ་པ་ཉིད་བཤད་པ་གང་ཡིན་པ་དང་། ཟད་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། འགོག་པ་ལ་སོགས་པའི་གཏམ་དང་། བསླབ་པའི་ཕན་ཡོན་བཤད་པ་དང་།
en: All the glorification passages; the explanation of the good qualities; the exchange between Śatakratu and Ānanda; the description of Māra and the work of Māra; the description of what happens because of it; how one should behave in the presence of persons in the Bodhisattva Vehicle; the explanation of sameness; the conversation about ending, detachment, and cessation and so on; the explanation of the benefits of training; surpassing nonperfect beings; the Śatakratu passage; immeasurable merit; and then again the Śatakratu passage are easy to understand from the scripture itself, so I have not explained them.

source: སེམས་ཅན་དང་། སེམས་ཅན་མ་ཡིན་པ་རྣམས་ཟིལ་གྱིས་གནོན་པ་དང་། བརྒྱ་བྱིན་གྱི་ཚིག་དང་།
en: No duality and no nonduality “One way or the other they should turn it over… in such a way that there is no notion of duality and no notion of nonduality.”

source: བསོད་ནམས་ཚད་མེད་པ་དང་། དེ་ནས་ཡང་བརྒྱ་བྱིན་གྱི་ཚིག་རྣམས་ནི་གཞུང་ཉིད་ལས་གོ་སླ་བས་རྣམ་པར་ཕྱེ་སྟེ་མ་བཤད་དོ། །ཅི་ནས་ཀྱང་གཉིས་ཀྱི་འདུ་ཤེས་སུ་འགྱུར་བ་མེད་པ་དང་གཉིས་མ་ཡིན་པའི་འདུ་ཤེས་སུ་འགྱུར་བ་མེད་པ་དེ་ལྟ་བུར་ཡོངས་སུ་བསྔོ་བར་བྱའོ་ཞེས་བྱ་བ་ནི་དེ་དག་གི་སེམས་བསྐྱེད་པ་གང་ཡིན་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་གང་ཡིན་པ་དེ་དག་དོན་དམ་པར་ཐ་དད་པ་མ་ཡིན་ཏེ། དེ་དག་གི་དེ་བཞིན་ཉིད་ནི་རྣམ་པར་དག་པར་རབ་ཏུ་ཕྱེ་བ་ཡིན་པས་དེའི་ཕྱིར་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ།
en: This is saying that ultimately their thought-productions and those unsurpassed, perfect, complete awakenings, whatever they are, are not different so, because their suchness is categorized as purity, there is therefore “no notion of duality.”

source: །གཉིས་ནི་དྲི་མ་དང་བཅས་པ་དང་།
en: The dual is when there are stains and when there are no stains.

source: དྲི་མ་མེད་པའི་བྱེ་བྲག་ལས་ཐ་དད་པ་ཡོད་པས་གཉིས་ཀྱི་འདུ་ཤེས་སུ་ཡང་འགྱུར་རོ།
en: The two exist as different particulars so there is also a notion of duality.

source: །དེ་བས་ན་གཅིག་པའི་ཕྱིར་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་ཞེས་གསུངས་སོ།
en: Therefore it says “there is no notion of duality” because they are the same.

source: །ཐ་དད་པའི་ཕྱིར་གཉིས་སུ་འདུ་ཤེས་སོ།
en: There is the notion of duality because they are different.

source: །ཡང་ན་ཡོད་པ་དང་། མེད་པ་ཞེས་བྱ་བ་ནི་གཉིས་སུ་འདུ་ཤེས་པའོ། །ཡོད་པ་ཡང་མ་ཡིན་མེད་པ་ཡང་མ་ཡིན་པ་ནི་གཉིས་སུ་འདུ་ཤེས་མེད་པ་སྟེ། དེ་ཡང་འོག་ནས་འབྱུང་བའི་གཞུང་གིས་གསལ་བར་བཤད་དོ།
en: Alternatively, as explained clearly in the part of the text that comes below, the notion of duality is of “existent and nonexistent,” and the notion of nonduality is of “nonexistent and not nonexistent.”

source: །དེ་ནས་ཡང་འོག་ནས་ཅི་ནས་ཀྱང་སེམས་དེ་ལ་ཡང་མ་ཡིན་ཞིང་།
en: Then also after that it says, “And one way or the other they should turn it over in such a way that awakening will not be in that thought, nor in another thought either.”

source: སེམས་གཞན་ལ་ཡང་མ་ཡིན་པ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱའོ་ཞེས་བྱ་བ་ནི་གནས་གྱུར་པའི་དབང་གིས་སེམས་དེ་ལ་ཡང་མ་ཡིན་པར་འགྱུར་རོ།
en: Based on the fact that there has been a transformation of the basis, it “will not be in that thought.”

source: །དོན་དམ་པར་ནི་ཐ་དད་པ་མེད་པས་སེམས་གཞན་ལ་ཡང་མ་ཡིན་པར་འགྱུར་རོ།
en: Ultimately they are not different so it will not be “in another thought either.” “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་སྒྱུ་མ་ལྟ་བུའི་སེམས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན།
en: Subhūti, what do you think, do you see that thought that is like an illusion?” What does this intend?

source: གལ་ཏེ་སེམས་སྒྱུ་མ་ལྟ་བུ་ཡིན་ལ། བྱང་ཆུབ་སྒྱུ་མ་ལྟ་བུ་མ་ཡིན་ན་ནི་དེ་ལྟ་ན་ཀླན་ཀར་འགྱུར་ན།
en: If a thought is like an illusion but awakening is not like an illusion, then there would be a fault.

source: འདི་ལྟར་སེམས་དང་བྱང་ཆུབ་གཉི་ག་ཡང་སྒྱུ་མ་ལྟ་བུ་ཡིན་ཏེ། དེའི་ཕྱིར་ཀླན་ཀ་མེད་དོ།
en: A thought and awakening are both like an illusion, however, therefore the fault is not there. “

source: །ཆོས་གང་ཤིན་ཏུ་དབེན་པ་དེ་ནི་མཆིས་པའམ་མ་མཆིས་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ནི།
en: The dharma that is extremely isolated will not be existent or nonexistent.”

source: ཀུན་བརྟགས་པའི་ཆོས་གང་ཡིན་པ་དེ་སྒྱུ་མ་ལྟ་བུ་ཡིན་པའི་ཕྱིར། །སྒྱུ་མ་དང་འདྲ་བར་ཡོད་དོ་ཞེས་བྱ་བའམ། མེད་དོ་ཞེས་བྱ་བར་བརྗོད་དུ་མི་རུང་ལ། ཡོད་པ་ཡང་མ་ཡིན་མེད་པ་ཡང་མ་ཡིན་ཞེས་ཀྱང་བརྗོད་དུ་མི་རུང་ངོ་།
en: A falsely imagined phenomenon is like an illusion, so, as with an illusion, it is not suitable to say “it is existent” or “it is nonexistent,” and it is also not suitable to say “it is not existent and it is not nonexistent” either.

source: །ཡོངས་སུ་གྲུབ་པའི་ཆོས་གང་ཡིན་པ་དེ་ཡང་དངོས་པོའི་རྣམ་པ་ཐམས་ཅད་ཀྱིས་དབེན་པའི་ཕྱིར་ཡོད་དོ་ཞེས་བརྗོད་དུ་མི་རུང་ངོ་།
en: A thoroughly established phenomenon is isolated from all aspects of a thing, so it is also not suitable to say “it is existent.”

source: །བརྗོད་དུ་མེད་པ་དབེན་པའི་རང་བཞིན་ཡོད་པའི་ཕྱིར་མེད་དོ་ཞེས་ཀྱང་བརྗོད་དུ་མི་རུང་ངོ་།
en: It is not suitable to say “it is nonexistent,” because its inexpressible isolated nature exists.

source: །ཡོད་དོ་ཞེས་བྱ་བའི་ཐ་སྙད་ཡོད་པའི་ཕྱིར་མེད་དོ་ཞེས་ཀྱང་བརྗོད་དུ་མི་རུང་ངོ་།
en: The convention “it is existent” also exists, so it is not suitable to say “it is nonexistent.”

source: །མེད་དོ་ཞེས་བྱ་བའི་ཐ་སྙད་ཡོད་པའི་ཕྱིར་མེད་པ་མ་ཡིན་ནོ་ཞེས་ཀྱང་བརྗོད་དུ་མི་རུང་ངོ་།
en: And the convention “it is nonexistent” also exists, so it is not suitable to say “it is not nonexistent.”

source: །དེ་བས་ན་གཉིས་ཀྱི་འདུ་ཤེས་དང་། གཉིས་སུ་མེད་པའི་འདུ་ཤེས་མི་རིགས་སོ།
en: Therefore, the notion of duality and the notion of nonduality are not tenable. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་གང་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བའམ། རྣམ་པར་བྱང་བར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་མ་མཆིས་ཤིང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་དང་།
en: Lord, it is because all those dharmas that are defiled or purified do not exist and are not apprehended.”

source: རྣམ་པར་བྱང་བར་འགྱུར་བའི་ཆོས་རྣམས་ཡོད་པ་མ་ཡིན་ཏེ། དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ཡང་། ནམ་མཁའ་བཞིན་དུ་རང་བཞིན་གྱིས་དབེན་པའི་ཕྱིར་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: Phenomena that become defiled and become purified do not exist because the defiled does not exist even when there are stains, because it is isolated from an intrinsic nature, like space.

source: །དེ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་སྔོན་མ་བྱུང་བའི་རྣམ་པར་བྱང་བ་ཡང་མེད་དོ།
en: And because that is just nonexistent, something not there before that has been purified is nonexistent too.

source: །འདི་ནི་སེམས་དེ་ལ་ཡང་མ་ཡིན། སེམས་གཞན་ལ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་བཤད་པ་ཡིན་ནོ།
en: This is the explanation of “it will not be in that thought, nor in another thought either.” “

source: །ཆོས་གང་ཤིན་ཏུ་དབེན་པ་དེ་ནི་བསྒོམ་པར་བགྱི་བ་ཡང་མ་ལགས།
en: And a dharma that is extremely isolated is not something you cultivate and not something you analyze.”

source: རྣམ་པར་གཞིག་པར་བགྱི་བ་ཡང་མ་ལགས་ཞེས་བྱ་བ་ལ་བསྒོམ་པ་ཞེས་བྱ་བ་ནི་གོམས་པར་བྱ་བ་སྟེ། དེ་དབེན་པའི་ཕྱིར་མི་རིགས་སོ།
en: To “cultivate” is to become habituated; that is untenable because it is isolated.

source: །རྣམ་པར་གཞིག་པ་ཞེས་བྱ་བ་ནི་དྲི་མ་བསྩལ་བ་སྟེ། དེ་ཡང་ཤིན་ཏུ་དབེན་པའི་ཕྱིར་མི་རིགས་སོ།
en: To “analyze” is to eliminate stains; that too is untenable because it is isolated. “

source: །བསྒྲུབ་པར་བགྱིད་པའི་ཆོས་ཀྱང་གང་ཡང་མ་མཆིས་ཞེས་བྱ་བ་ནི་ཤིན་ཏུ་དབེན་པའི་ཕྱིར་བྱང་ཆུབ་ཐོབ་པར་བྱེད་པ་མ་ཡིན་པའོ།
en: There is not any dharma that is bringing anything about.” Because it is extremely isolated it is not something that causes the attainment of awakening. “

source: །དབེན་པ་ཉིད་ལགས་པའི་སླད་དུ་ཇི་ལྟར་དབེན་པས་དབེན་པ་རྗེས་སུ་རྟོགས་པར་འགྱུར་ཞེས་བྱ་བ་ནི་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Given that it is extremely isolated, how will there be a realization of the isolated by the isolated?”

source: ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དབེན་པ་ཡིན་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པས་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དབེན་པ་ཇི་ལྟར་རྗེས་སུ་རྟོག་པར་འགྱུར་ཞེས་ཞུས་པའོ།
en: Given that the perfection of wisdom and perfect, complete awakening are extremely isolated how will an isolated perfection of wisdom come to realize an isolated perfect complete awakening?

source: །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: With “exactly so, Subhūti, exactly so!”

source: །དེ་དེ་བཞིན་ཏེ་ཞེས་བྱ་བ་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་གསུངས་ཏེ། གལ་ཏེ་གཅིག་ནི་དབེན་ལ། ཅིག་ཤོས་ནི་མི་དབེན་པ་ཞིག་ཡིན་ན་ནི་དེ་ལྟ་ན་ནི་མི་རིགས་པར་འགྱུར་ན།
en: the Lord teaches that were one to be isolated but the other not isolated, in that case it would not be tenable.

source: འདི་ལྟར་དེ་གཉིས་ཀ་ཡང་དབེན་པས་དེའི་ཕྱིར་ཉེས་པ་མེད་དེ།
en: But both are isolated like that, so there is therefore no fault.

source: ཆོས་ཐམས་ཅད་ཀྱི་དབེན་པའི་མཚན་ཉིད་དེ་ཉིད་ཤེས་ན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་སྟོན་ཏོ། །བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན།
en: When the true reality that all dharmas are marked as isolated is understood, then there is complete, full awakening. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དཀའ་བ་བགྱིད་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནི། གལ་ཏེ་ལ་ལ་ནི་དམིགས། ལ་ལ་ནི་མི་དམིགས་ན་ནི་དེ་ལྟ་ན་མི་མཐུན་པས་དཀའ་བར་འགྱུར་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ཡོད་པ་མ་ཡིན་ཏེ། མེད་པ་ཉིད་ཀྱི་ཕྱིར་མི་དམིགས་སོ།
en: The way I understand the meaning of what you, Lord, have said, is that bodhisattva great beings are not those who do what is difficult” means that when one thing is apprehended and another thing is not apprehended, it is difficult because they do not conform, but since all dharmas do not exist—that is, are nonexistent things—they are not apprehended.

source: །མེད་པ་ནི་མི་དམིགས་པ་ཞེས་བྱ་བར་ཤེས་པར་མི་དཀའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It is not difficult to understand that you cannot apprehend something that does not exist. “

source: །བཅོམ་ལྡན་འདས་མི་དམིགས་པར་སྤྱོད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྟེ་ཞེས་བྱ་བ་ནི་མི་དམིགས་པར་སྤྱོད་པ་མ་གཏོགས་པ་སྤྱོད་པ་གཞན་མེད་དོ།
en: Lord this course of action where nothing is apprehended is the course of action of bodhisattvas.” There is no course of action except a course of action where nothing is apprehended.

source: །དེའི་འོག་ཏུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་མི་རྟོག་པ་ཉིད་དུ་བསྟན་པ་ནི་གོ་སླའོ།། །།
en: Then it teaches that the perfection of wisdom is a state without thought construction. That is easy to understand.

source: བམ་པོ་ཉི་ཤུ་བཞི་པ། འགྲོ་བ་ལྔར་འཁོར་བ་ཞེས་ཐ་དད་དུ་དབྱེ་བ་འདི་ཅི་ལས་གྱུར་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བྱ་བ་ལ་སོགས་པའི་དབྱེ་བའང་ཅི་ལས་གྱུར་ཅེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་སྟོན་ཏོ།
en: Cyclic existence and nirvāṇa “How has this division of cyclic existence into the five forms of life… come about, and how do the categorizations of stream enterer,” and so on, come about?

source: །གལ་ཏེ་ཆོས་ཐམས་ཅད་རྣམ་པར་མི་རྟོག་པ་ཡིན་ན་འཁོར་བ་དང་། རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ཅི་ལས་བྱུང་ཞེས་དྲིས་པའོ།
en: This is asking how, if all phenomena are without thought construction, the cycles of existence and purification dharmas come about.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་སྩལ་པ། འདི་དག་ནི་ཕྱིན་ཅི་ལོག་པ་སྟེ། མེད་པ་ལ་འཛིན་པ། ཡོད་པ་སྒྲིབ་པར་བྱེད་པའི་མཚན་ཉིད་དོ།
en: Then the Lord states that these thought constructions are in error; they are marked by grasping at the nonexistent and by obscuring the existent.

source: །དེ་དག་དང་འདྲེས་པའི་ཕྱིར། འདོད་ཆགས་དང་ཞེ་སྡང་ལ་སོགས་པའི་རྣམ་པར་རྟོག་པ་ཡང་ཡོད་པ་ལ་ནི་སྒྲིབ་པོ།
en: Because they are mixed up with them, thought constructions that are greedy, hating, and so on obscure the existent.

source: །མེད་པ་ལ་ནི་འཛིན་ཏོ།
en: They grasp at the nonexistent.

source: །དེ་དག་གིས་བསྐྱེད་པའི་ཕྱིར། བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་ལ་སོགས་པའི་ལས་བྱེད་པའི་སེམས་པ་ཡང་།
en: Because they give rise to them, intentions to perform karmic action that is meritorious, demeritorious, and so on also grasp at error.

source: ཕྱིན་ཅི་ལོག་ཏུ་འཛིན་པ་ཡིན་ཏེ་ལས་དེ་དང་རྣམ་པར་རྟོག་པ་དེ་དག་གིས་བསྐྱེད་པའི་ཕྱིར། རྣམ་པར་སྨིན་པའི་ཤེས་པ་ཡང་དེ་ཁོ་ན་ཉིད་འཛིན་པ་མ་ཡིན་ནོ།
en: Because those actions and those thought constructions give rise to the maturation consciousnesses, they do not grasp true reality either.

source: །དེ་བས་ན་འདུན་པ་དང་། འདོད་ཆགས་ལ་སོགས་པ་ཡང་དེ་ཁོ་ན་མ་ཡིན་པའི་ཡུལ་ཅན་ཏེ། ཀུན་འབྱུང་བ་ཐམས་ཅད་ནི་ཡང་དག་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ།
en: Therefore “the desire-to-do” and greed and so on have what is not true reality as their object, so all origination is not a true intrinsic nature.

source: །སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། {ཡི་དགས་,ཡི་དྭགས་}དང་། ལྷ་དང་མིའི་འགྲོ་བ་རྣམས་ཞེས་བྱ་བ་ནི་འགྲོ་བ་ལྔ་པོ་དག་དེ་ཁོ་ནའི་ངོ་བོ་ཉིད་དུ་སྟོན་ཏེ།
en: The “five forms of life” “in the hells, animal world, and world of Yama, and as a human and god” are explained as the intrinsic nature of true reality.

source: དེའི་ཕྱིར་ཆོས་རྣམས་རྣམ་པར་མི་རྟོག་པ་ཡིན་ཡང་དེ་ལྟར་འཁོར་བར་རྣམ་པར་གཞག་གོ། །རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ལ་ཡང་།
en: Therefore, even though all phenomena are not thought construction, cyclic existence is still presented like that.

source: རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་རྣམ་པར་གཞག་ཅིང་། ཐམས་ཅད་ཀྱང་རྣམ་པར་མི་རྟོག་པ་ཉིད་དེ། རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ནས། དེ་བཞིན་གཤེགས་པའི་བར་དུ་ངོ་བོ་ཉིད་ཀྱིས་ཐ་དད་པ་ནི་གང་ཡང་མེད་དེ། ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་སྐུ་ལས་མ་འདས་པའི་ཕྱིར་རོ་ཞེས་བསྟན་པའོ།
en: Also, for purification dharmas it presents all the stream enterers and so on as simply not constructed in thought, teaching that in their intrinsic there is no difference in nature between stream enterers and so on, up to tathāgatas, because all phenomena do not pass beyond the dharma body.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་ཉིད་ཐོས་པས་ཤཱ་རིའི་བུའི་བློ་རྒྱ་ཆེར་གྱུར་ནས།
en: Having thus heard about the true dharmic nature of the perfection of wisdom, Śāriputra’s understanding greatly increases and he says, “Ah!

source: ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་ནི་སྙིང་པོ་ལ་སྤྱོད་པའོ་ཞེས་གསུངས་པ་དང་།
en: Those bodhisattva great beings who are practicing this perfection of wisdom make a practice of something really worthwhile.”

source: དེ་ནས་རབ་འབྱོར་གྱིས་སྙིང་པོ་མེད་པ་ལ་སྤྱོད་པའོ་ཞེས་གསུངས་ཏེ།
en: Subhūti then says that they “make a practice of something that is not worthwhile!”

source: དངོས་པོ་མེད་པ་དང་། ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་སྙིང་པོ་མེད་པ་ཉིད་ཡིན་པར་དེའི་ཡིད་ལ་བཞག་ནས།
en: It is not worthwhile because it is not a real thing and is not something that exists.

source: སྙིང་པོ་མེད་པ་ཉིད་ཀྱང་མི་དམིགས་ན་སྙིང་པོ་དམིགས་པ་ལྟ་ག་ལ་ཡོད་ཅེས་འཇིག་རྟེན་པའི་རིགས་པ་གསུངས་ཏེ།
en: With that in mind, using ordinary reasoning it says they “do not apprehend even something not worthwhile, so however could they apprehend something really worthwhile?”
